"""
3)	Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо создать класс Клетка.
В его конструкторе инициализировать параметр, соответствующий количеству ячеек клетки (целое число).
В классе должны быть реализованы методы перегрузки арифметических операторов: сложение (__add__()),
вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).
Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное
(с округлением до целого) деление клеток, соответственно.

"""


class Cell:
    def __init__(self, num):
        self.num = int(num)

# Сложение.Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
    def __add__(self, other):
        return Cell(self.num + other.num)

# Вычитание.Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше
#  нуля, иначе выводить соответствующее сообщение.
    def __sub__(self, other):
        if self.num > other.num:
            return Cell(self.num - other.num)
        else:
            return f"Результат операции вычитания будет отрицательным числом!!!"

# Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек
# этих двух клеток.

    def __mul__(self, other):
        return Cell(self.num * other.num)

# Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
# ячеек этих двух клеток.

    def __truediv__(self, other):
        return Cell(self.num // other.num)
# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
# Данный метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
#  Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order()
# вернет строку: *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: *****\n*****\n*****.

    def make_order(self, cells_in_row):
        row = ''
        for i in range(int(self.num / cells_in_row)):
            row += f'{"*" * cells_in_row} \\n'
            row += f'{"*" * (self.num % cells_in_row)}'
        return row

    def __str__(self) -> str:
        return f"Клетка состоит из {self.num} ячеек"


cell_1 = Cell(7)
cell_2 = Cell(10)

print(cell_1 + cell_2)
print(cell_1 - cell_2)
print(cell_2 - cell_1)
print(cell_1 * cell_2)
print(cell_1 / cell_2)
print(cell_1.make_order(5))
print(cell_2.make_order(5))